<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#列操作" data-toc-modified-id="列操作-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>列操作</a></span><ul class="toc-item"><li><span><a href="#增加列" data-toc-modified-id="增加列-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>增加列</a></span></li><li><span><a href="#插入列" data-toc-modified-id="插入列-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>插入列</a></span></li><li><span><a href="#删除列" data-toc-modified-id="删除列-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>删除列</a></span><ul class="toc-item"><li><span><a href="#del-df[要删除的列名]" data-toc-modified-id="del-df[要删除的列名]-1.3.1"><span class="toc-item-num">1.3.1&nbsp;&nbsp;</span>del df[要删除的列名]</a></span></li><li><span><a href="#df.pop(要删除的列名)" data-toc-modified-id="df.pop(要删除的列名)-1.3.2"><span class="toc-item-num">1.3.2&nbsp;&nbsp;</span>df.pop(要删除的列名)</a></span></li><li><span><a href="#df.drop(coumns=要删除的列名)" data-toc-modified-id="df.drop(coumns=要删除的列名)-1.3.3"><span class="toc-item-num">1.3.3&nbsp;&nbsp;</span>df.drop(coumns=要删除的列名)</a></span></li></ul></li><li><span><a href="#修改列" data-toc-modified-id="修改列-1.4"><span class="toc-item-num">1.4&nbsp;&nbsp;</span>修改列</a></span><ul class="toc-item"><li><span><a href="#修改列的值-df[要修改的列]-=-新值" data-toc-modified-id="修改列的值-df[要修改的列]-=-新值-1.4.1"><span class="toc-item-num">1.4.1&nbsp;&nbsp;</span>修改列的值 df[要修改的列] = 新值</a></span></li><li><span><a href="#修改列的名" data-toc-modified-id="修改列的名-1.4.2"><span class="toc-item-num">1.4.2&nbsp;&nbsp;</span>修改列的名</a></span><ul class="toc-item"><li><span><a href="#df.columns-=--包含新列名的列表" data-toc-modified-id="df.columns-=--包含新列名的列表-1.4.2.1"><span class="toc-item-num">1.4.2.1&nbsp;&nbsp;</span>df.columns =  包含新列名的列表</a></span></li><li><span><a href="#df.rename()" data-toc-modified-id="df.rename()-1.4.2.2"><span class="toc-item-num">1.4.2.2&nbsp;&nbsp;</span>df.rename()</a></span></li></ul></li></ul></li><li><span><a href="#去重列" data-toc-modified-id="去重列-1.5"><span class="toc-item-num">1.5&nbsp;&nbsp;</span>去重列</a></span></li></ul></li><li><span><a href="#行操作" data-toc-modified-id="行操作-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>行操作</a></span><ul class="toc-item"><li><span><a href="#增加行" data-toc-modified-id="增加行-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>增加行</a></span></li><li><span><a href="#删除行" data-toc-modified-id="删除行-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>删除行</a></span></li><li><span><a href="#重置行索引" data-toc-modified-id="重置行索引-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span>重置行索引</a></span></li></ul></li></ul></div>

In [1]:
#全部行都能输出
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

import numpy as np
import pandas as pd

# 列操作

In [2]:
df = pd.DataFrame({'员工姓名':['小明', '小李', '小红'], 
                     '基本工资':[3500, 4000, 4500], 
                     '销售业绩':[8000, 12000, 6000]})
df

  员工姓名  基本工资   销售业绩
0   小明  3500   8000
1   小李  4000  12000
2   小红  4500   6000

## 增加列  
比如我们增加一列 **销售提成**， 提成是销售业绩的5个点， 也是5%

In [3]:
df.销售业绩  # 这样可以单独提取出一列， 单独的一个是Series结构

0     8000
1    12000
2     6000
Name: 销售业绩, dtype: int64

In [4]:
df.销售业绩*0.05

0    400.0
1    600.0
2    300.0
Name: 销售业绩, dtype: float64

In [5]:
df['销售提成'] = df.销售业绩*0.05

In [6]:
df

  员工姓名  基本工资   销售业绩   销售提成
0   小明  3500   8000  400.0
1   小李  4000  12000  600.0
2   小红  4500   6000  300.0

再创建一列 **应发工资** = 基本工资+销售提成

In [7]:
df['应发工资'] = df.基本工资+df.销售提成

In [8]:
df

  员工姓名  基本工资   销售业绩   销售提成    应发工资
0   小明  3500   8000  400.0  3900.0
1   小李  4000  12000  600.0  4600.0
2   小红  4500   6000  300.0  4800.0

增加一列， **出勤天数**  
小明 24  
小李 22   
小红 23

In [9]:
df['出勤天数'] = [24, 22, 23]

In [10]:
df

  员工姓名  基本工资   销售业绩   销售提成    应发工资  出勤天数
0   小明  3500   8000  400.0  3900.0    24
1   小李  4000  12000  600.0  4600.0    22
2   小红  4500   6000  300.0  4800.0    23

## 插入列  
在 **员工姓名** 后面插入**性别**  
男 男 女

In [11]:
df

  员工姓名  基本工资   销售业绩   销售提成    应发工资  出勤天数
0   小明  3500   8000  400.0  3900.0    24
1   小李  4000  12000  600.0  4600.0    22
2   小红  4500   6000  300.0  4800.0    23

In [12]:
df.insert(1, '性别', ['男', '男', '女'])

In [13]:
df

  员工姓名 性别  基本工资   销售业绩   销售提成    应发工资  出勤天数
0   小明  男  3500   8000  400.0  3900.0    24
1   小李  男  4000  12000  600.0  4600.0    22
2   小红  女  4500   6000  300.0  4800.0    23

**在性别之后插入一列年龄**  
23 24 25

In [14]:
df

  员工姓名 性别  基本工资   销售业绩   销售提成    应发工资  出勤天数
0   小明  男  3500   8000  400.0  3900.0    24
1   小李  男  4000  12000  600.0  4600.0    22
2   小红  女  4500   6000  300.0  4800.0    23

In [15]:
df.insert(2, '年龄', [23, 24, 25])

In [16]:
df

  员工姓名 性别  年龄  基本工资   销售业绩   销售提成    应发工资  出勤天数
0   小明  男  23  3500   8000  400.0  3900.0    24
1   小李  男  24  4000  12000  600.0  4600.0    22
2   小红  女  25  4500   6000  300.0  4800.0    23

## 删除列

### del df[要删除的列名]  
会直接在原数据上修改

In [17]:
df['a'] = [1, 2, 3]
df

  员工姓名 性别  年龄  基本工资   销售业绩   销售提成    应发工资  出勤天数  a
0   小明  男  23  3500   8000  400.0  3900.0    24  1
1   小李  男  24  4000  12000  600.0  4600.0    22  2
2   小红  女  25  4500   6000  300.0  4800.0    23  3

In [18]:
del df['a']  # 直接在原表上进行删除

In [19]:
df

  员工姓名 性别  年龄  基本工资   销售业绩   销售提成    应发工资  出勤天数
0   小明  男  23  3500   8000  400.0  3900.0    24
1   小李  男  24  4000  12000  600.0  4600.0    22
2   小红  女  25  4500   6000  300.0  4800.0    23

### df.pop(要删除的列名)  
直接会在原表上删除该列， 并会以Series返回该列

In [20]:
df

  员工姓名 性别  年龄  基本工资   销售业绩   销售提成    应发工资  出勤天数
0   小明  男  23  3500   8000  400.0  3900.0    24
1   小李  男  24  4000  12000  600.0  4600.0    22
2   小红  女  25  4500   6000  300.0  4800.0    23

In [21]:
df['A'] = 3  # 如果是一个标量会自动全部用这个标量填充

In [22]:
df

  员工姓名 性别  年龄  基本工资   销售业绩   销售提成    应发工资  出勤天数  A
0   小明  男  23  3500   8000  400.0  3900.0    24  3
1   小李  男  24  4000  12000  600.0  4600.0    22  3
2   小红  女  25  4500   6000  300.0  4800.0    23  3

In [23]:
df.pop('A')  # 直接会在原表上删除该列， 并会以Series返回该列

0    3
1    3
2    3
Name: A, dtype: int64

In [24]:
df

  员工姓名 性别  年龄  基本工资   销售业绩   销售提成    应发工资  出勤天数
0   小明  男  23  3500   8000  400.0  3900.0    24
1   小李  男  24  4000  12000  600.0  4600.0    22
2   小红  女  25  4500   6000  300.0  4800.0    23

### df.drop(coumns=要删除的列名)

In [25]:
df

  员工姓名 性别  年龄  基本工资   销售业绩   销售提成    应发工资  出勤天数
0   小明  男  23  3500   8000  400.0  3900.0    24
1   小李  男  24  4000  12000  600.0  4600.0    22
2   小红  女  25  4500   6000  300.0  4800.0    23

In [26]:
df['a1'] = [1, 2, 3]
df['a2'] = [4, 5, 6]
df['a3'] = [7, 8, 9]
df

  员工姓名 性别  年龄  基本工资   销售业绩   销售提成    应发工资  出勤天数  a1  a2  a3
0   小明  男  23  3500   8000  400.0  3900.0    24   1   4   7
1   小李  男  24  4000  12000  600.0  4600.0    22   2   5   8
2   小红  女  25  4500   6000  300.0  4800.0    23   3   6   9

In [27]:
df.drop(columns = 'a1')  #直接这样会返回新的表， 不会改变原来的表

  员工姓名 性别  年龄  基本工资   销售业绩   销售提成    应发工资  出勤天数  a2  a3
0   小明  男  23  3500   8000  400.0  3900.0    24   4   7
1   小李  男  24  4000  12000  600.0  4600.0    22   5   8
2   小红  女  25  4500   6000  300.0  4800.0    23   6   9

In [28]:
df

  员工姓名 性别  年龄  基本工资   销售业绩   销售提成    应发工资  出勤天数  a1  a2  a3
0   小明  男  23  3500   8000  400.0  3900.0    24   1   4   7
1   小李  男  24  4000  12000  600.0  4600.0    22   2   5   8
2   小红  女  25  4500   6000  300.0  4800.0    23   3   6   9

In [29]:
df.drop(columns = 'a1', inplace = True)

In [30]:
df

  员工姓名 性别  年龄  基本工资   销售业绩   销售提成    应发工资  出勤天数  a2  a3
0   小明  男  23  3500   8000  400.0  3900.0    24   4   7
1   小李  男  24  4000  12000  600.0  4600.0    22   5   8
2   小红  女  25  4500   6000  300.0  4800.0    23   6   9

In [31]:
df.drop(columns = ['a2', 'a3'], inplace = True)  # 删除多列就给columns传入一个包含列名的列表

In [32]:
df

  员工姓名 性别  年龄  基本工资   销售业绩   销售提成    应发工资  出勤天数
0   小明  男  23  3500   8000  400.0  3900.0    24
1   小李  男  24  4000  12000  600.0  4600.0    22
2   小红  女  25  4500   6000  300.0  4800.0    23

## 修改列

### 修改列的值 df[要修改的列] = 新值

In [33]:
df

  员工姓名 性别  年龄  基本工资   销售业绩   销售提成    应发工资  出勤天数
0   小明  男  23  3500   8000  400.0  3900.0    24
1   小李  男  24  4000  12000  600.0  4600.0    22
2   小红  女  25  4500   6000  300.0  4800.0    23

**比如， 现在老板把业绩的提成从5%升到10%**

In [34]:
df['销售提成'] = df.销售业绩*0.1

In [35]:
df

  员工姓名 性别  年龄  基本工资   销售业绩    销售提成    应发工资  出勤天数
0   小明  男  23  3500   8000   800.0  3900.0    24
1   小李  男  24  4000  12000  1200.0  4600.0    22
2   小红  女  25  4500   6000   600.0  4800.0    23

### 修改列的名

#### df.columns =  包含新列名的列表
修改全部列的名字

In [36]:
df1 = df.copy()
df1

  员工姓名 性别  年龄  基本工资   销售业绩    销售提成    应发工资  出勤天数
0   小明  男  23  3500   8000   800.0  3900.0    24
1   小李  男  24  4000  12000  1200.0  4600.0    22
2   小红  女  25  4500   6000   600.0  4800.0    23

In [37]:
df1.columns = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h']   # 直接在原列表上修改

In [38]:
df1

    a  b   c     d      e       f       g   h
0  小明  男  23  3500   8000   800.0  3900.0  24
1  小李  男  24  4000  12000  1200.0  4600.0  22
2  小红  女  25  4500   6000   600.0  4800.0  23

#### df.rename()   
单独修改某些列的名字

In [39]:
df2 = df.copy()
df2

  员工姓名 性别  年龄  基本工资   销售业绩    销售提成    应发工资  出勤天数
0   小明  男  23  3500   8000   800.0  3900.0    24
1   小李  男  24  4000  12000  1200.0  4600.0    22
2   小红  女  25  4500   6000   600.0  4800.0    23

比如把**应发工资**改变成**实发工资**

In [40]:
df2.rename(columns = {'应发工资':'实发工资'}, inplace=True)

In [41]:
df2

  员工姓名 性别  年龄  基本工资   销售业绩    销售提成    实发工资  出勤天数
0   小明  男  23  3500   8000   800.0  3900.0    24
1   小李  男  24  4000  12000  1200.0  4600.0    22
2   小红  女  25  4500   6000   600.0  4800.0    23

## 去重列

In [42]:
df

  员工姓名 性别  年龄  基本工资   销售业绩    销售提成    应发工资  出勤天数
0   小明  男  23  3500   8000   800.0  3900.0    24
1   小李  男  24  4000  12000  1200.0  4600.0    22
2   小红  女  25  4500   6000   600.0  4800.0    23

In [43]:
df.insert(2, '性别', df.性别, allow_duplicates=True)

In [44]:
df

  员工姓名 性别 性别  年龄  基本工资   销售业绩    销售提成    应发工资  出勤天数
0   小明  男  男  23  3500   8000   800.0  3900.0    24
1   小李  男  男  24  4000  12000  1200.0  4600.0    22
2   小红  女  女  25  4500   6000   600.0  4800.0    23

In [45]:
df.T.drop_duplicates().T

  员工姓名 性别  年龄  基本工资   销售业绩  销售提成  应发工资 出勤天数
0   小明  男  23  3500   8000   800  3900   24
1   小李  男  24  4000  12000  1200  4600   22
2   小红  女  25  4500   6000   600  4800   23

# 行操作

## 增加行

In [46]:
df = df.T.drop_duplicates().T
df

  员工姓名 性别  年龄  基本工资   销售业绩  销售提成  应发工资 出勤天数
0   小明  男  23  3500   8000   800  3900   24
1   小李  男  24  4000  12000  1200  4600   22
2   小红  女  25  4500   6000   600  4800   23

In [47]:
df.loc[3] = ['小兰', '女', 18, 10000, 10000, 1000, 4000, 20]

In [48]:
df

  员工姓名 性别  年龄   基本工资   销售业绩  销售提成  应发工资 出勤天数
0   小明  男  23   3500   8000   800  3900   24
1   小李  男  24   4000  12000  1200  4600   22
2   小红  女  25   4500   6000   600  4800   23
3   小兰  女  18  10000  10000  1000  4000   20

## 删除行

In [49]:
df.loc[4] = ['小兰', '女', 18, 10000, 10000, 1000, 4000, 20]
df.loc[5] = ['小兰', '女', 18, 10000, 10000, 1000, 4000, 20]
df.loc[6] = ['小兰', '女', 18, 10000, 10000, 1000, 4000, 20]

In [50]:
df

  员工姓名 性别  年龄   基本工资   销售业绩  销售提成  应发工资 出勤天数
0   小明  男  23   3500   8000   800  3900   24
1   小李  男  24   4000  12000  1200  4600   22
2   小红  女  25   4500   6000   600  4800   23
3   小兰  女  18  10000  10000  1000  4000   20
4   小兰  女  18  10000  10000  1000  4000   20
5   小兰  女  18  10000  10000  1000  4000   20
6   小兰  女  18  10000  10000  1000  4000   20

In [51]:
df.drop(index=5, inplace=True)

In [52]:
df

  员工姓名 性别  年龄   基本工资   销售业绩  销售提成  应发工资 出勤天数
0   小明  男  23   3500   8000   800  3900   24
1   小李  男  24   4000  12000  1200  4600   22
2   小红  女  25   4500   6000   600  4800   23
3   小兰  女  18  10000  10000  1000  4000   20
4   小兰  女  18  10000  10000  1000  4000   20
6   小兰  女  18  10000  10000  1000  4000   20

In [53]:
df.drop(index=[3, 4], inplace=True)

In [54]:
df

  员工姓名 性别  年龄   基本工资   销售业绩  销售提成  应发工资 出勤天数
0   小明  男  23   3500   8000   800  3900   24
1   小李  男  24   4000  12000  1200  4600   22
2   小红  女  25   4500   6000   600  4800   23
6   小兰  女  18  10000  10000  1000  4000   20

## 重置行索引

In [55]:
df

  员工姓名 性别  年龄   基本工资   销售业绩  销售提成  应发工资 出勤天数
0   小明  男  23   3500   8000   800  3900   24
1   小李  男  24   4000  12000  1200  4600   22
2   小红  女  25   4500   6000   600  4800   23
6   小兰  女  18  10000  10000  1000  4000   20

In [56]:
df.reset_index(drop=True, inplace=True)

In [57]:
df

  员工姓名 性别  年龄   基本工资   销售业绩  销售提成  应发工资 出勤天数
0   小明  男  23   3500   8000   800  3900   24
1   小李  男  24   4000  12000  1200  4600   22
2   小红  女  25   4500   6000   600  4800   23
3   小兰  女  18  10000  10000  1000  4000   20